In [2]:
import pandas as pd
import numpy as np

C:\Users\wq\AppData\Local\Temp\ipykernel_324\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
s1 = pd.Series(np.random.randn(5))
s2 = pd.Series(np.random.randn(5))

In [4]:
df = pd.concat([s1,s2], axis = 1)
df

          0         1
0  0.877979  0.607840
1 -0.243766 -1.000628
2 -1.378718 -1.182091
3 -0.414509  1.386614
4 -0.123586  0.851068

In [5]:
# change name of cols
df.columns = ['col1', 'col2']
df

       col1      col2
0  0.877979  0.607840
1 -0.243766 -1.000628
2 -1.378718 -1.182091
3 -0.414509  1.386614
4 -0.123586  0.851068

In [6]:
# add a col
df['sum'] = df['col1'] + df['col2']
df['mul'] = df['col1'] * df['col2']
df

       col1      col2       sum       mul
0  0.877979  0.607840  1.485819  0.533671
1 -0.243766 -1.000628 -1.244394  0.243919
2 -1.378718 -1.182091 -2.560808  1.629769
3 -0.414509  1.386614  0.972105 -0.574764
4 -0.123586  0.851068  0.727482 -0.105180

In [7]:
# remove a col
df.drop(columns=['sum', 'mul'], inplace=True)
df

       col1      col2
0  0.877979  0.607840
1 -0.243766 -1.000628
2 -1.378718 -1.182091
3 -0.414509  1.386614
4 -0.123586  0.851068

In [8]:
df

       col1      col2
0  0.877979  0.607840
1 -0.243766 -1.000628
2 -1.378718 -1.182091
3 -0.414509  1.386614
4 -0.123586  0.851068

In [9]:
# remove a row
# df.drop(4, inplace=True)
df.drop(index=4, inplace=True)
df

       col1      col2
0  0.877979  0.607840
1 -0.243766 -1.000628
2 -1.378718 -1.182091
3 -0.414509  1.386614

In [17]:
df['div'] = df['col1'] / df['col2']
df

       col1      col2       div
0  0.877979  0.607840  1.444424
1 -0.243766 -1.000628  0.243613
2 -1.378718 -1.182091  1.166339
3 -0.414509  1.386614 -0.298936

In [19]:
df.drop('div', axis = 1)
df.drop(columns='div')

       col1      col2
0  0.877979  0.607840
1 -0.243766 -1.000628
2 -1.378718 -1.182091
3 -0.414509  1.386614